src/Documents/Statement.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<Document>
		<Properties>
			<Name>Statement</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Company</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Companies</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>BeginOfPeriod</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/AccountingRegisters/GeneralJournal.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<AccountingRegister>
		<Properties>
			<Name>GeneralJournal</Name>
			<ChartOfAccounts>ChartOfAccounts.ChartOfAccounts</ChartOfAccounts>
			<Correspondence>false</Correspondence>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Currency</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Currencies</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Amount</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>AmountRC</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
				</Properties>
			</Resource>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

src/InformationRegisters/DocumentJournalOfCompanies.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<InformationRegister>
		<Properties>
			<Name>DocumentJournalOfCompanies</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>DocumentStatus</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Date</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>DueDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Total</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Memo</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Company</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Companies</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Document</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.GeneralJournalEntry</v8:Type>
						<v8:Type>cfg:DocumentRef.Deposit</v8:Type>
						<v8:Type>cfg:DocumentRef.CashSale</v8:Type>
						<v8:Type>cfg:DocumentRef.SalesReturn</v8:Type>
						<v8:Type>cfg:DocumentRef.Check</v8:Type>
						<v8:Type>cfg:DocumentRef.PurchaseInvoice</v8:Type>
						<v8:Type>cfg:DocumentRef.Quote</v8:Type>
						<v8:Type>cfg:DocumentRef.TimeTrack</v8:Type>
						<v8:Type>cfg:DocumentRef.Statement</v8:Type>
						<v8:Type>cfg:DocumentRef.CashReceipt</v8:Type>
						<v8:Type>cfg:DocumentRef.PurchaseOrder</v8:Type>
						<v8:Type>cfg:DocumentRef.InvoicePayment</v8:Type>
						<v8:Type>cfg:DocumentRef.SalesInvoice</v8:Type>
						<v8:Type>cfg:DocumentRef.PurchaseReturn</v8:Type>
						<v8:Type>cfg:DocumentRef.SalesOrder</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Line</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Documents/Deposit.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<Document>
		<Properties>
			<Name>Deposit</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ClassData</xr:Item>
				<xr:Item>AccumulationRegister.ProjectData</xr:Item>
				<xr:Item>AccountingRegister.GeneralJournal</xr:Item>
				<xr:Item>AccumulationRegister.BankReconciliation</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>DocumentTotal</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Memo</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>BankAccount</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.ChartOfAccounts</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DocumentTotalRC</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>TotalDeposits</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>TotalDepositsRC</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AutoGenerated</Name>
					<Comment>If generated automatically (e.g. in Cloud Banking)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>LineItems</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Document</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.CashSale</v8:Type>
								<v8:Type>cfg:DocumentRef.CashReceipt</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>DocumentTotal</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Payment</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>DocumentTotalRC</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Currency</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Currencies</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Customer</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Companies</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Accounts</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Account</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.ChartOfAccounts</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Amount</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Memo</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Company</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Companies</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Class</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Classes</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Project</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Projects</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Documents/Check.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<Document>
		<Properties>
			<Name>Check</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.CashFlowData</xr:Item>
				<xr:Item>AccumulationRegister.ClassData</xr:Item>
				<xr:Item>AccumulationRegister.ProjectData</xr:Item>
				<xr:Item>AccountingRegister.GeneralJournal</xr:Item>
				<xr:Item>AccumulationRegister.BankReconciliation</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>BankAccount</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.ChartOfAccounts</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Memo</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Company</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Companies</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DocumentTotalRC</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DontCreate</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ExchangeRate</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DocumentTotal</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PaymentMethod</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.PaymentMethods</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PhysicalCheckNum</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Project</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Projects</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>URL</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Voided</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DwollaTrxID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CoinbaseTrxID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RemitAddress</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Addresses</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AutoGenerated</Name>
					<Comment>If generated automatically (e.g. in Cloud Banking)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>LineItems</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Account</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.ChartOfAccounts</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Amount</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Memo</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Class</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Classes</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Project</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Projects</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Documents/Statement/Ext/ManagerModule.bsl
Procedure Print(Spreadsheet, RefArray) Export
	
	Template = Documents.Statement.GetTemplate("Print");
		
	Header      = Template.GetArea("Header");
	Line        = Template.GetArea("Line");
	LineForward = Template.GetArea("LineForward");
	Footer      = Template.GetArea("Footer");
	Spreadsheet.Clear();

	InsertPageBreak = False;
	For Each Ref In RefArray Do
		
		If InsertPageBreak Then
			Spreadsheet.PutHorizontalPageBreak();
		EndIf;
		
		//ActivityOfCompany
		Query = New Query;
		Query.Text = "SELECT
		             |	1 AS MyOrder,
		             |	NULL AS RecorderPointInTime,
		             |	""Balance Forward"" AS Recorder,
		             |	&ForwardPeriod AS DocDate,
		             |	GeneralJournalBalance.ExtDimension1 AS Company,
		             |	NULL AS AmountRCOpeningBalance,
		             |	NULL AS AmountRCTurnover,
		             |	GeneralJournalBalance.AmountRCBalance AS AmountRCClosingBalance
		             |INTO TV
		             |FROM
		             |	AccountingRegister.GeneralJournal.Balance(&ForwardPeriod, , , ExtDimension1 = &Company) AS GeneralJournalBalance
		             |
		             |UNION ALL
		             |
		             |SELECT
		             |	1,
		             |	NULL,
		             |	""Balance Forward"",
		             |	&ForwardPeriod,
		             |	&Company,
		             |	NULL,
		             |	NULL,
		             |	0
		             |
		             |UNION ALL
		             |
		             |SELECT
		             |	2,
		             |	GeneralJournalBalanceAndTurnovers.Recorder.PointInTime,
		             |	GeneralJournalBalanceAndTurnovers.Recorder,
		             |	GeneralJournalBalanceAndTurnovers.Recorder.Date,
		             |	GeneralJournalBalanceAndTurnovers.ExtDimension1,
		             |	GeneralJournalBalanceAndTurnovers.AmountRCOpeningBalance,
		             |	GeneralJournalBalanceAndTurnovers.AmountRCTurnover,
		             |	GeneralJournalBalanceAndTurnovers.AmountRCClosingBalance
		             |FROM
		             |	AccountingRegister.GeneralJournal.BalanceAndTurnovers(&BeginOfPeriod, &EndOfPeriod, Auto, , , , ExtDimension1 = &Company) AS GeneralJournalBalanceAndTurnovers
		             |WHERE
		             |	GeneralJournalBalanceAndTurnovers.Recorder IS NOT NULL 
		             |	AND GeneralJournalBalanceAndTurnovers.Recorder <> UNDEFINED
		             |
		             |UNION ALL
		             |
		             |SELECT
		             |	2,
		             |	DocumentJournalOfCompanies.Document.PointInTime,
		             |	DocumentJournalOfCompanies.Document,
		             |	DocumentJournalOfCompanies.Date,
		             |	DocumentJournalOfCompanies.Company,
		             |	NULL,
		             |	CASE
		             |		WHEN DocumentJournalOfCompanies.Document REFS Document.CashSale
		             |				OR DocumentJournalOfCompanies.Document REFS Document.Deposit
		             |				OR DocumentJournalOfCompanies.Document REFS Document.Check
		             |			THEN DocumentJournalOfCompanies.Total
		             |		ELSE NULL
		             |	END,
		             |	NULL
		             |FROM
		             |	InformationRegister.DocumentJournalOfCompanies AS DocumentJournalOfCompanies
		             |WHERE
		             |	DocumentJournalOfCompanies.Company = &Company
		             |	AND DocumentJournalOfCompanies.DocumentStatus = 1
		             |	AND DocumentJournalOfCompanies.Date BETWEEN &BeginOfPeriod AND &EndOfPeriod
		             |	AND NOT DocumentJournalOfCompanies.Document REFS Document.SalesOrder
		             |	AND NOT DocumentJournalOfCompanies.Document REFS Document.PurchaseOrder
		             |	AND NOT DocumentJournalOfCompanies.Document REFS Document.TimeTrack
		             |	AND NOT DocumentJournalOfCompanies.Document REFS Document.Statement
		             |;
		             |
		             |////////////////////////////////////////////////////////////////////////////////
		             |SELECT
		             |	TV.MyOrder AS MyOrder,
		             |	TV.RecorderPointInTime AS RecorderPointInTime,
		             |	TV.Recorder,
		             |	TV.DocDate,
		             |	TV.Company,
		             |	SUM(TV.AmountRCOpeningBalance) AS AmountRCOpeningBalance,
		             |	SUM(TV.AmountRCTurnover) AS AmountRCTurnover,
		             |	SUM(TV.AmountRCClosingBalance) AS AmountRCClosingBalance
		             |FROM
		             |	TV AS TV
		             |
		             |GROUP BY
		             |	TV.DocDate,
		             |	TV.Recorder,
		             |	TV.RecorderPointInTime,
		             |	TV.Company,
		             |	TV.MyOrder
		             |
		             |ORDER BY
		             |	MyOrder,
		             |	RecorderPointInTime";
		
		Query.SetParameter("ForwardPeriod", Ref.BeginOfPeriod - 1);
		Query.SetParameter("BeginOfPeriod", Ref.BeginOfPeriod);
		Query.SetParameter("EndOfPeriod", EndOfDay(Ref.Date));
		Query.SetParameter("Company", Ref.Company);
		
		ActivityOfCompany = Query.Execute().Select(); 
		//End ActivityOfCompany
		
		//ARAging
		ARAgingQuery = New Query;
		ARAgingQuery.Text = "SELECT
		                    |	CASE
		                    |		WHEN DATEDIFF(GeneralJournalBalance.ExtDimension2.DueDate, &EndOfPeriod, DAY) <= 0
		                    |			THEN GeneralJournalBalance.AmountRCClosingBalance
		                    |		WHEN GeneralJournalBalance.ExtDimension2 REFS Document.CashReceipt
		                    |			THEN GeneralJournalBalance.AmountRCClosingBalance
		                    |		WHEN GeneralJournalBalance.ExtDimension2 REFS Document.PurchaseReturn
		                    |			THEN GeneralJournalBalance.AmountRCClosingBalance
		                    |		WHEN GeneralJournalBalance.ExtDimension2 REFS Document.GeneralJournalEntry
		                    |			THEN GeneralJournalBalance.AmountRCClosingBalance
		                    |		WHEN DATEDIFF(GeneralJournalBalance.ExtDimension2.DueDate, &EndOfPeriod, DAY) > &Interval3
		                    |				AND GeneralJournalBalance.ExtDimension2 REFS Document.SalesReturn
		                    |			THEN GeneralJournalBalance.AmountRCClosingBalance
		                    |		ELSE 0
		                    |	END AS D0,
		                    |	CASE
		                    |		WHEN DATEDIFF(GeneralJournalBalance.ExtDimension2.DueDate, &EndOfPeriod, DAY) <= &Interval1
		                    |				AND DATEDIFF(GeneralJournalBalance.ExtDimension2.DueDate, &EndOfPeriod, DAY) > 0
		                    |				AND NOT GeneralJournalBalance.ExtDimension2 REFS Document.GeneralJournalEntry
		                    |			THEN GeneralJournalBalance.AmountRCClosingBalance
		                    |		ELSE 0
		                    |	END AS D1,
		                    |	CASE
		                    |		WHEN DATEDIFF(GeneralJournalBalance.ExtDimension2.DueDate, &EndOfPeriod, DAY) <= &Interval2
		                    |				AND DATEDIFF(GeneralJournalBalance.ExtDimension2.DueDate, &EndOfPeriod, DAY) > &Interval1
		                    |				AND NOT GeneralJournalBalance.ExtDimension2 REFS Document.GeneralJournalEntry
		                    |			THEN GeneralJournalBalance.AmountRCClosingBalance
		                    |		ELSE 0
		                    |	END AS D2,
		                    |	CASE
		                    |		WHEN DATEDIFF(GeneralJournalBalance.ExtDimension2.DueDate, &EndOfPeriod, DAY) <= &Interval3
		                    |				AND DATEDIFF(GeneralJournalBalance.ExtDimension2.DueDate, &EndOfPeriod, DAY) > &Interval2
		                    |				AND NOT GeneralJournalBalance.ExtDimension2 REFS Document.GeneralJournalEntry
		                    |			THEN GeneralJournalBalance.AmountRCClosingBalance
		                    |		ELSE 0
		                    |	END AS D3,
		                    |	CASE
		                    |		WHEN DATEDIFF(GeneralJournalBalance.ExtDimension2.DueDate, &EndOfPeriod, DAY) > &Interval3
		                    |				AND NOT GeneralJournalBalance.ExtDimension2 REFS Document.SalesReturn
		                    |				AND NOT GeneralJournalBalance.ExtDimension2 REFS Document.PurchaseReturn
		                    |				AND NOT GeneralJournalBalance.ExtDimension2 REFS Document.GeneralJournalEntry
		                    |			THEN GeneralJournalBalance.AmountRCClosingBalance
		                    |		ELSE 0
		                    |	END AS D4,
		                    |	GeneralJournalBalance.AmountRCClosingBalance AS TotalD
		                    |FROM
		                    |	AccountingRegister.GeneralJournal.BalanceAndTurnovers(&BeginOfPeriod, &EndOfPeriod, Auto, , , , ExtDimension1 = &Company) AS GeneralJournalBalance";
							
		ARAgingQuery.SetParameter("BeginOfPeriod", Ref.BeginOfPeriod);
		ARAgingQuery.SetParameter("EndOfPeriod", EndOfDay(Ref.Date));
		ARAgingQuery.SetParameter("Company", Ref.Company);
		ARAgingQuery.SetParameter("Interval1", 30);
		ARAgingQuery.SetParameter("Interval2", 60);
		ARAgingQuery.SetParameter("Interval3", 90);
		
		ARAgingOfCompany = ARAgingQuery.Execute().Unload(); 
		
		AmountDue = ARAgingOfCompany.Total("TotalD"); 
		//End ARAging
		
		//Header
		ParametersOfHeader = New Structure; 
		ParametersOfHeader.Insert("OurCompany", Constants.SystemTitle.Get()); 
		ParametersOfHeader.Insert("Company", Ref.Company); 
		ParametersOfHeader.Insert("Number", Ref.Number); 
		ParametersOfHeader.Insert("Date", Ref.Date); 
		ParametersOfHeader.Insert("AmountDue", AmountDue); 
		ParametersOfHeader.Insert("BeginOfPeriod", Format(Ref.BeginOfPeriod, "DLF=D")); 
		ParametersOfHeader.Insert("EndOfPeriod", Format(Ref.Date, "DLF=D"));
		
		Header.Parameters.Fill(ParametersOfHeader);
		Spreadsheet.Put(Header);
		//End Header
		
		//Line
		PreviousBalance = 0;
		
		While ActivityOfCompany.Next() Do
			
			ParametersOfLine = New Structure;
			ParametersOfLine.Insert("DateActivity", ActivityOfCompany.DocDate);
			ParametersOfLine.Insert("Activity", ActivityOfCompany.Recorder);
			ParametersOfLine.Insert("Amount", ActivityOfCompany.AmountRCTurnover);
			ParametersOfLine.Insert("Balance", ?(ActivityOfCompany.AmountRCClosingBalance = Null, PreviousBalance, ActivityOfCompany.AmountRCClosingBalance));
			
			If ActivityOfCompany.MyOrder = 1 Then
				LineForward.Parameters.Fill(ParametersOfLine);
				Spreadsheet.Put(LineForward);
			Else
				Line.Parameters.Fill(ParametersOfLine);
				Spreadsheet.Put(Line);
			EndIf;
			
			PreviousBalance = ActivityOfCompany.AmountRCClosingBalance; 
			
		EndDo;
		//End Line
		
		//Footer
		ParametersOfFooter = New Structure;
		ParametersOfFooter.Insert("Current", ARAgingOfCompany.Total("D0"));
		ParametersOfFooter.Insert("Days1_30", ARAgingOfCompany.Total("D1"));
		ParametersOfFooter.Insert("Days31_60", ARAgingOfCompany.Total("D2"));
		ParametersOfFooter.Insert("Days61_90", ARAgingOfCompany.Total("D3"));
		ParametersOfFooter.Insert("Days91", ARAgingOfCompany.Total("D4"));
		ParametersOfFooter.Insert("AmountDue", AmountDue);
		ParametersOfFooter.Insert("CurrentDate", Format(CurrentSessionDate(), "DF='dddd, MMM d, yyyy h:mm:ss tt'"));
		
		Footer.Parameters.Fill(ParametersOfFooter);
		Spreadsheet.Put(Footer);
		//End Footer

		InsertPageBreak = True;
	EndDo;
	
	Spreadsheet.FitToPage = True;
	
EndProcedure
